src/cf/Documents/РеализацияТоваровИУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>РеализацияТоваровИУслуг</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Баллы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КартаЛаяльности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КартыЛояльности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписатьБаллы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Скидка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСписанныхБалов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/AccumulationRegisters/Баллы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>Баллы</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КартаЛояльности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КартыЛояльности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/Documents/РеализацияТоваровИУслуг/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Объект.СписатьБаллы Тогда
		
		Элементы.КоличествоСписанныхБалов.Доступность = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СписатьБаллыПриИзменении(Элемент)

	Если Не Объект.СписатьБаллы Тогда
		
		Объект.КоличествоСписанныхБалов = 0; 
		Элементы.КоличествоСписанныхБалов.Доступность = Ложь;
		
	Иначе	
		Элементы.КоличествоСписанныхБалов.Доступность = Истина;
	КонецЕсли; 
	
	ПересчитатьСуммаДокумента();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КартаЛаяльностиПриИзмененииНаСервере(КартаЛаяльности)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БаллыОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.Баллы.Остатки КАК БаллыОстатки
		|ГДЕ
		|	БаллыОстатки.КартаЛояльности = &КартаЛояльности";
	
	Запрос.УстановитьПараметр("КартаЛояльности", КартаЛаяльности);
	
	РезультатЗапроса = Запрос.Выполнить();
	
		
	Выборка = РезультатЗапроса.Выбрать();  
	
	Если Выборка.Следующий()Тогда
		 Возврат Выборка.КоличествоОстаток;
	Иначе 	 
		 Возврат 0;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура КартаЛаяльностиПриИзменении(Элемент)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("РеализацияТоваровИУслуг.Переключатель.КартаЛаяльности");
			
	КолВоБалов = КартаЛаяльностиПриИзмененииНаСервере(Объект.КартаЛаяльности); 
	
	Если КолВоБалов > 0 Тогда
		ВсегоБалов = КолВоБалов; 
	Иначе 	
		ВсегоБалов = 0;
	КонецЕсли;  
	
	ПересчитатьСуммаДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент) 
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ТекущиеДанные.Сумма = ТекущиеДанные.Количество * ТекущиеДанные.Цена;  
	
	ПересчитатьСуммаДокумента();
		
КонецПроцедуры

&НаКлиенте
Процедура КоличествоСписанныхБаловПриИзменении(Элемент)
	
  Если Объект.КоличествоСписанныхБалов > ВсегоБалов Тогда
  
  	   Объект.КоличествоСписанныхБалов = ВсегоБалов;
	   
	   Сообщение = Новый СообщениеПользователю;
	   Сообщение.Текст = "Можно списать максимум " + ВсегоБалов + " !";
	   Сообщение.Сообщить();
  
  КонецЕсли;
	
  Объект.Скидка = Объект.КоличествоСписанныхБалов; 
  
  ПересчитатьСуммаДокумента();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПересчитатьСуммаДокумента();

	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") - Объект.КоличествоСписанныхБалов; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

 Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
 
 	  УИОДОП = ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Ложь, "РеализацияТоваровИУслуг");
 
  КонецЕсли;
 
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ОценкаПроизводительностиКлиент.ЗавершитьЗамерВремени(УИОДОП);
	КонецЕсли;

КонецПроцедуры


#КонецОбласти
